# 1. Работа с регистром
# ================================================
from builtins import PythonFinalizationError

# s = "Python для автоматизации"
# print(s.lower())
# print(s.upper())

# 2. Подсчет вхождений подстроки
# ================================================

# msg = "абракадабра"
# print(msg.count("ра"))
# print(msg[2:].count("а"))

# 3. Поиск подстроки
# ================================================
# msg = "абракадабра"
# print(msg.find("ка"))
# print(msg.rfind("а"))
# print(msg.find("xyz"))

# 4. Замена подстроки
# ================================================

# text = "Я изучаю Java"
# print(text.replace('Java','Python'))
# print(text.replace(" ",""))

# 5. Проверка содержимого строки
# ================================================

# text = "Python"
# text2 = "12345"
# text3 = "123abf"
# print(text.isalpha())
# print(text2.isdigit())
# print(text3.isdigit())

# 6. Дополнение строк
# ================================================
# code = "42"
# print(code.zfill(5))
#
# mytext = "text"
# print(mytext.ljust(10, "*"))

# 7. Разбиение строк
# ================================================

# apple = "яблоко, груша, банан"
# print(apple.split(", "))
#
# word = "Python;Java;C++"
# print(word.split(";"))

# 8. Объединение списка в строку
# ================================================

# words = "Привет", "мир", "!"
# words_2 = "apple", "banana", "cherry"
# print(" ".join(words))
# print(", ".join(words_2))

# 9. Удаление пробелов
# ================================================

# leftspace = " Python"
# print(leftspace.lstrip())
# rightspace = "Python "
# print(rightspace.rstrip())
# midlespace = "  Python  "
# print(midlespace.strip())

# 10. Дополнительное задание
# ================================================

# text = "программирование"
# print(text.capitalize())
#
# text.count("р")
# print(text.count("р"))
# print(text.find("и"))
# print(text[::-1])

# Спецсимволы
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Перевод строки
# ================================================

# text = "Hello\nPython"
# print(text)
# символ \n заставляет Python перенести текст на новую строку

# 2. Горизонтальная табуляция
# ================================================

# text = "Python\tAutomation"
# print(text)
# \t — это специальный управляющий символ, который называется табуляцией она даёт удлиннёный пробел как будто на клавиатуре нажимаем TAB

# 3. Экранирование символов
# ================================================

# path = "C:\new\test.txt"
# print(path)
#
# path1 = "C:\\new\\test.txt"
# print(path1)
#
# vine =  "Марка вина \"Ягодка\""
# print(vine)

# 4. Сырые (raw) строки
# ================================================

# path = r"C:\new\test.txt"
# print(f"Сырая строка",path)
# # Не воспринимает никакие элементы внутри и не нужно экранирование
#
#
# path2 = "C:\\new\\test.txt"
# print(f"Обычная строка",path2)

# 5. Использование разных спецсимволов
# ================================================

# s = "Hello\b World"
# print(s)
# # Hell World
#
#
# s2 = "Hello\fPython"
# print(s2)

# 6. Дополнительное задание
# ================================================
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Форматирование строк
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Формирование строк через конкатенацию
# # ================================================

# name = "Vitaliy"
# age = "35"
#
# message2 = "Меня зовут " + name + ", мне " + age + " лет."
# TypeError: can only concatenate str (not "int") to str

# name = "Cucumber"
# age = "35"
#
# why = "Приветики, меня зовут {} и мне {} лет".format(name, age)
#
# why2 = "Приветики, меня зовут {} и мне {} лет".format(age, name)
# print(why2)

# 3. Использование F-строк
# ================================================

# city = "Odincovo"
# year = 2025
#
# current = f"Сегодня {year} и я живу в : {city}"
# print(current)
#
# future = f"Через 5 лет будет {year + 5} год."
# print(future)

# name = "Vitaliy"
# age = 35
#
# doubleage = f"Дважды мой возраст: {age * 2}"
# print(doubleage)
#
# upname = f"Имя в верхнем регистре: {name.upper()}"
# print(upname)

# 5. Дополнительное задание
# ================================================

# dollar = 92.5
# rate = f"Курс валют: 1 доллар = {dollar} рубля.".format(dollar)
# print(rate)
#
# num = 7
# sqare = f"Кавдрат числа {num} равен {num ** 2}."
# print(sqare)